Repository: OpenChain-KWG/Specification-Translation-KR
Catalog: Specification-Translation-KR-level1.tmx
Source language: en_us
Languages: ko

source: **Please Translate Here.** This is an official translation from the OpenChain Project.
ko: 이 문서는 OpenChain Project의 공식 번역본입니다.

source: 1.1.1 A documented FOSS policy exists.
ko: 1.1.1 문서화된 FOSS 정책이 존재한다.

source: 1.1.2 A documented procedure exists that makes all Software Staff aware of the existence of the FOSS policy (e.g., via training, internal wiki, or other practical communication method).
ko: 1.1.2 모든 소프트웨어 공급담당자가 FOSS 정책의 존재를 인식하게 하는 문서화된 절차(예: 교육, 내부 wiki 혹은 기타 실질적인 의사소통 방법)가 존재한다.

source: 1.2.1 FOSS training materials covering the above topics exists (e.g., slide decks, online course, or other training materials).
ko: 1.2.1 위의 주제를 다루는 FOSS 교육 자료(예: 슬라이드 자료, 온라인 과정 혹은 이외 교육 자료)가 존재한다

source: 1.2.2 Method of tracking the completion of the training for all Software Staff.
ko: 1.2.2 모든 소프트웨어 공급담당자가 교육을 완료하였는지 추적하는 방법.

source: 1.2.3 At least 85% of the Software Staff are current, as per the definition in above section.
ko: 1.2.3 적어도 소프트웨어 공급담당자의 85%가 현재 교육 이수 상태(위 정의됨).

source: 2.1.1 FOSS Liaison function is publicly identified (e.g., via a published contact email address, or the Linux Foundation's Open Compliance Directory).
ko: 2.1.1 FOSS 연락담당자의 역할이 공개적으로 확인된다. (예: 공개된 연락처 이메일 주소 또는 Linux Foundation의 Open Compliance Directory를 통해).

source: 2.1.2 An internal documented procedure exists that assigns responsibility for receiving FOSS compliance inquiries.
ko: 2.1.2 FOSS Compliance 문의의 접수 책임을 할당한 문서화된 내부 절차가 존재한다.

source: 2.2.1 Name of persons, group or function in FOSS Compliance role(s) internally identified.
ko: 2.2.1 내부적으로 지정된 FOSS Compliance 담당자들, 조직 혹은 직무 이름.

source: 2.2.2 Identify source of legal expertise available to FOSS Compliance role(s) which could be internal or external.
ko: 2.2.2 FOSS Compliance 담당자가 사용할 수 있는 내부 또는 외부의 법률 전문 지식의 제공처를 지정한다.

source: 2.2.3 A documented procedure exists that assigns internal responsibilities for FOSS compliance.
ko: 2.2.3 FOSS Compliance를 위한 내부 책임을 할당하는 문서화된 절차가 존재한다.

source: 2.2.4 A documented procedure exists for handling the review and remediation of non-compliant cases.
ko: 2.2.4 미준수 사례의 검토 및 시정을 규정하는 문서화된 절차가 존재한다.

source: 3.1 A process exists for creating and managing a FOSS component bill of materials which includes each component (and its Identified Licenses) in a Supplied Software release.
ko: 3.1 공급대상 소프트웨어 배포판 내의 각 Component (및 그 식별된 라이선스)를 포함하는 FOSS Component 구성목록 (bill of material, BOM)을 작성하고 관리하는 프로세스가 존재한다.

source: 3.2.1 A procedure has been implemented that handles the common FOSS license use cases for the FOSS components of each Supplied Software release.
ko: 3.2.1 각 공급대상 소프트웨어 배포판의 FOSS Component에 대한 일반적인 FOSS 라이선스 사용 사례를 다루는 절차가 구현되었다.

source: 4.1 Prepare the set of artifacts which represent the output of the FOSS management program for each Supplied Software release.
ko: 4.1 각 공급 대상 소프트웨어 배포판에 대해 FOSS 관리 프로그램의 산출물을 나타내는 일련의 결과물 집합을 준비한다.

source: 5.1.1 A documented FOSS contribution policy exists;
ko: 5.1.1 문서화된 FOSS 기여 정책이 존재한다;

source: 5.1.2 A documented procedure exists that makes all Software Staff aware of the existence of the FOSS contribution policy (e.g., via training, internal wiki, or other practical communication method).
ko: 5.1.2 모든 소프트웨어 공급담당자가 FOSS 기여 정책의 존재를 알도록 하는 문서화된 절차(예: 교육, 내부 wiki, 혹은 다른 실제적인 의사소통 방법을 통해)가 존재한다.

source: 5.2.1 Provided the FOSS contribution policy permits contributions, a documented procedure exists that governs FOSS contributions.
ko: 5.2.1 FOSS 기여 정책이 이러한 기여 활동을 허용하는 경우, FOSS 기여 절차를 규정하는 문서화된 절차가 존재한다.

source: 6.1.1 The organization affirms that a FOSS management program exists that meets all the requirements of this OpenChain Specification version 1.1.
ko: 6.1.1 조직은 이 OpenChain 설명서 1.1 버전의 모든 요구 사항을 충족하는 FOSS 관리 프로그램이 존재함을 확약한다.

source: 6.2.1 The organization affirms that a FOSS management program exists that meets all the requirements of this OpenChain Specification version 1.1 within the past 18 months of achieving conformance validation.
ko: 6.2.1 조직은 준수 확인을 받은 후 18개월 동안은 이 OpenChain 설명서 1.1 버전의 모든 요구사항을 충족하는 FOSS 관리 프로그램이 존재함을 확약한다.

source: The policy must be internally communicated.
ko: 이 정책은 내부적으로 전달되어야 한다.

source: The requirements represent a base level (minimum) set of requirements a program must satisfy to be considered OpenChain Conforming.
ko: 이 요구사항은 프로그램이 OpenChain을 준수하는 것으로 인정하기 위해 충족해야 하는 기본 수준 (최소) 요구사항들을 의미한다.

source: That a procedure exists to support this activity and that the procedure is followed.
ko: 이 활동을 지원하기 위한 절차가 존재하고 그 절차가 준수되는지를 보장하기 위함.

source: The mere meeting of a subset of these requirements would not be considered sufficient to warrant a program be OpenChain certified.
ko: 이 요구사항의 일부만을 충족하는 것만으로는 그 프로그램이 OpenChain 인증된 것으로 보증하기에 충분하지 않을 것이다.

source: **Please Translate Here.** In the event there is confusion between a translation and the English version, The English text shall take precedence.
ko: 번역본과 영문본 사이에 불일치가 있는 경우, 영문 문서가 우선합니다.

source: The intent is to ensure a core base level set of topics are covered but a typical training program would likely be more comprehensive than what is required here.
ko: 의도는 핵심 기본 수준의 주제가 포함되도록 하기 위한 것이지만 일반적인 교육 프로그램은 여기에서 요구되는 것보다 더 포괄적 일 수 있다.

source: Conformance validation requirements can be found on the OpenChain project’s website.
ko: 준수 확인 요건은 OpenChain 프로젝트의 웹사이트에서 찾을 수 있다.

source: Depending on the organization, that may include (but is not limited to) software developers, release engineers, quality engineers, product marketing and product management.
ko: 조직에 따라 소프트웨어 개발자, Release Engineer, 품질 Engineer, 제품 마케팅 및 제품 관리자가 포함될 수 있지만, 이에 국한되지 않는다.

source: **Please Translate Here.** It has been translated from the original English text.
ko: 원본인 영문 문서가 번역되었습니다.

source: A documented procedure for handling the common FOSS license use cases for the FOSS components of the Supplied Software release.
ko: 각 공급대상 소프트웨어 배포판의 FOSS Component에 대한 일반적인 FOSS 라이선스 사용 사례를 다루는 서면화된 절차

source: A documented procedure to review and document the obligations, restrictions and rights granted by each Identified License.
ko: 식별된 각 라이선스에 의해 부과되는 의무, 제한 및 권리를 검토하고 문서화하기 위한 문서화된 절차

source: A bill of materials is needed to support the systematic review of each component’s license terms to understand the obligations and restrictions as it applies to the distribution of the Supplied Software.
ko: 공급대상 소프트웨어의 배포에 적용되는 의무와 제한 사항을 이해하기 위해 각 Component의 라이선스 조항에 대한 체계적 검토를 지원하려면 BOM이 필요하다.

source: A copy of the license can be found at https://creativecommons.org/licenses/by/4.0/ .
ko: 이 라이선스의 사본은 여기서는 얻을 수 있습니다 : https://creativecommons.org/licenses/by/4.0/ .

source: A copy of the license can be obtained here: CC-BY-4.0
ko: 그 라이선스의 사본은 여기서 얻을 수 있습니다: CC-BY-4.0

source: A description of the SPDX specification can be found at www.spdx.org.
ko: SPDX 설명서에 대한 설명은 www.spdx.org에서 확인할 수 있다.

source: A description of the SPDX specification can be found at ww.spdx.org.
ko: SPDX 설명서에 대한 설명은 www.spdx.org에서 확인할 수 있다.

source: A documented FOSS contribution policy;
ko: 문서화된 FOSS 기여 정책;

source: A documented FOSS contribution policy exists;
ko: 문서화된 FOSS 기여 정책이 존재한다;

source: A documented FOSS policy exists.
ko: 문서화된 FOSS 정책이 존재한다.

source: A documented FOSS policy.
ko: 문서화된 정책.

source: A documented procedure that makes all Software Staff aware of the existence of the FOSS contribution policy (e.g., via training, internal wiki, or other practical communication method).
ko: 모든 소프트웨어 공급담당자가 FOSS 기여 정책의 존재를 알도록 하는 문서화된 절차(예: 교육, 내부 wiki, 혹은 다른 실제적인 의사소통 방법을 통해).

source: A documented procedure exists for identifying, tracking and archiving information about the collection of FOSS components from which a Supplied Software release is comprised.
ko: 공급대상 소프트웨어 배포판을 구성하는 FOSS Component들의 집합에 대한 정보를 식별, 추적 및 보관하기 위한 문서화된 절차가 존재한다.

source: A documented procedure exists that ensures the Compliance Artifacts are prepared and distributed with Supplied Software release as required by the Identified Licenses.
ko: 식별된 라이선스에서 요구하는 대로 Compliance 결과물이 준비되어서 공급 대상 소프트웨어와 함께 배포되도록 보장하는 문서화된 절차가 존재한다.

source: A documented procedure exists describing a process that ensures the Distributed Compliance Artifacts be distributed with Supplied Software as required by the Identified Licenses.
ko: 식별된 라이선스에서 요구하는 대로 공급대상 소프트웨어와 함께 배포할 Compliance 결과물이 배포되도록 보장하는 프로세스를 설명하는 문서화된 절차가 존재한다.

source: A documented procedure exists that assigns responsibilities for FOSS compliance.
ko: FOSS Compliance에 대한 책임을 할당한 문서화된 절차가 존재한다.

source: A documented procedure exists that assigns responsibility for receiving FOSS compliance inquiries.
ko: FOSS Compliance 문의의 접수 책임을 할당한 문서화된 절차가 존재한다.

source: A documented procedure exists that identifies an escalation path for issue resolution.
ko: 이슈 해결을 위한 긴급대응절차를 확인하는 문서화된 절차가 존재한다.

source: A documented procedure exists that makes all Software Staff aware of the existence of the FOSS contribution policy (e.g., via training, internal wiki, or other practical communication method).
ko: 모든 소프트웨어 공급담당자가 FOSS 기여 정책의 존재를 알도록 하는 문서화된 절차(예: 교육, 내부 wiki, 혹은 다른 실제적인 의사소통 방법을 통해)가 존재한다.

source: A documented procedure exists that makes all Software Staff aware of the existence of the FOSS policy (e.g., via training, internal wiki, or other practical communication method).
ko: 모든 소프트웨어 공급담당자가 FOSS 정책의 존재를 인식하게 하는 문서화된 절차(예: 교육, 내부 wiki 혹은 기타 실질적인 의사소통 방법)가 존재한다.

source: A documented procedure exists to review and document the obligations, restrictions and rights granted by each Identified License governing the Supplied Software.
ko: 공급 대상 소프트웨어에 적용되는 각 식별된 라이선스에 의해 부과되는 의무, 제한 및 권리를 검토하고 문서화하기 위한 문서화된 절차가 존재한다.

source: A documented procedure exists used to identify, track, and archive a list of FOSS components and their Identified Licenses from which the Supplied Software is comprised.
ko: 공급대상 소프트웨어에 포함된 FOSS Component 들 및 그 식별된 라이선스 목록을 식별, 추적, 보관하는 문서화된 절차가 존재한다.

source: A documented procedure that ensures the Compliance Artifacts are prepared and distributed with the Supplied Software release as required by the Identified Licenses.
ko: 식별된 라이선스에서 요구하는 대로 컴플라이언스 결과물이 준비되어서 공급 대상 소프트웨어와 함께 배포되도록 보장하는 문서화된 절차.

source: A documented procedure for handling the review and remediation of non-compliant cases.
ko: 미준수 사례의 검토 및 시정을 규정하는 문서화된 절차

source: A documented procedure for identifying, tracking and archiving information about the collection of FOSS components from which a Supplied Software release is comprised.
ko: 공급대상 소프트웨어 배포판에 포함되어 있는 FOSS Component들 집합에 대한 정보를 식별, 추적 및 보관하기 위한 문서화된 절차.

source: A documented procedure that assigns internal responsibilities for FOSS compliance.
ko: FOSS 컴플라이언스를 위한 내부 책임을 할당하는 문서화된 절차

source: A documented procedure that makes Software Staff aware of the existence of the FOSS policy (e.g., via training, internal wiki, or other practical communication method).
ko: 모든 소프트웨어 공급담당자가 FOSS 정책의 존재를 인식하게 하는 문서화된 절차(예: 교육, 내부 wiki 혹은 기타 실질적인 의사소통 방법)

source: A policy may exist such that contributions are not permitted at all.
ko: 기여가 전혀 허용되지 않는 정책이 있을 수도 있다.

source: A process exists for creating and managing a FOSS component bill of materials which includes each component (and its Identified Licenses) from which the Supplied Software is comprised.
ko: 공급대상 소프트웨어 내의 각 Component(및 그 식별된 라이선스)를 포함하는 FOSS Component 목록(BOM)을 작성하고 관리하는 프로세스가 존재한다.

source: A process exists for creating the set of Compliance Artifacts for each Supplied Software.
ko: 각 공급 대상 소프트웨어에 대해 컴플라이언스 결과물 세트를 작성하기 위한 프로세스가 존재한다.

source: A process exists for identifying, tracking and archiving a list of all FOSS components (and their respective Identified Licenses) from which Supplied Software is comprised.
ko: 공급대상 소프트웨어에 포함된 모든 FOSS Component들(및 그 각 식별된 라이선스)을 식별, 추적 및 보관하는 프로세스가 존재한다.

source: A process exists for reviewing the Identified Licenses to determine the obligations, restrictions and rights granted by each license.
ko: 식별된 라이선스를 검토하여 각 라이선스가 부여하는 의무, 제한 및 권한을 결정하기 위한 프로세스가 존재한다.

source: A process exists for the resolution of FOSS compliance issues.
ko: FOSS 컴플라이언스 이슈의 해결을 위한 프로세스가 존재한다.

source: A process has been implemented that is capable of addressing the typical FOSS use cases encountered by Software Staff for Supplied Software.
ko: 공급대상 소프트웨어에 대해 소프트웨어 공급관리자가 만나게 되는 전형적인 FOSS 사용 사례를 처리할 수 있는 프로세스가 구현되었다.

source: A study group was formed to consider whether a standard program specification could be created that would: i) facilitate greater quality and consistency of open source compliance information being shared across the industry; and ii) decrease the high transaction costs associated with open source resulting from compliance rework.
ko: 이에 다음의 역할을 하는 표준적 프로그램 설명서가 제작될 수 있는지 검토하기 위해 스터디 그룹이 구성되었다: i) 업계에서 공유되는 오픈소스 Compliance 정보의 품질과 일관성 향상; ii) Compliance 재작업으로 인해 발생하는 높은 오픈소스 관련 거래 비용의 절감.

source: A test may be used to allow Software Staff to satisfy the training requirement.
ko: 소프트웨어 공급담당자가 교육 요건을 충족할 수 있도록 하기 위해 테스트가 행해질 수 있다.

source: A written FOSS policy exists that governs FOSS license compliance of the Supplied Software distribution.
ko: 공급 대상 소프트웨어 배포 시에 필요한 FOSS 라이선스 Compliance를 규정하는 문서화된 FOSS 정책이 존재한다.

source: A written FOSS policy exists that governs FOSS license compliance of the Supplied Software distribution where, as a minimum, it must be internally communicated.
ko: 공급 대상 소프트웨어 배포 시에 필요한 FOSS 라이선스 Compliance를 규정하고 최소한 내부에서 소통되어야 하는 문서화된 FOSS 정책이 존재한다.

source: A written policy exists that governs contributions to FOSS projects by the organization.
ko: 조직이 FOSS 프로젝트에 기여하는 것을 관리하는 문서화된 정책이 존재한다.

source: A written policy exists that governs contributions to publicly accessible FOSS projects by employees on behalf of the organization where, as a minimum, it must be internally communicated.
ko: 조직을 대신하여 직원이 공개적으로 접근할 수 있는 FOSS 프로젝트에 기여하는 것을 규정하는 문서화된 정책이 존재하고 그 정책이 최소한 내부적으로 전파되어야 한다.

source: Additional clarification on how to interpret the specification can be obtained by reviewing the Specification Frequently Asked Questions (FAQs) located at:
ko: 설명서를 해석하는 방법에 대한 추가 설명은 다음 위치에 있는 설명서 FAQ(자주 묻는 질문)를 검토하여 얻을 수 있다 :

source: Although no requirements are provided here on what should be included in the policy, other requirements in other sections may.
ko: 이 절에서는 정책에 포함되어야 할 요구사항이 규정되지 않지만, 다른 절에서 정책에 요구사항을 부과할 수도 있다.

source: Although no requirements are provided here on what should be included in the policy, other sections may impose requirements on the policy.
ko: 이 절에서는 정책에 포함되어야 할 요건이 규정되지 않지만, 다른 절에서 정책에 요건을 부과할 수도 있다.

source: An affirmation of the existence of a FOSS management program that meets all the requirements of this OpenChain Specification version 1.2.
ko: 이 OpenChain 1.2 버전의 모든 요건을 충족하는 FOSS 관리 프로그램의 존재 확약.

source: An internal documented procedure that assigns responsibility for receiving FOSS compliance inquiries.
ko: FOSS 컴플라이언스 문의의 접수 책임을 할당하는 내부 문서화된 절차

source: Appendix I: Language Translations
ko: 부록 I: 언어 번역

source: As a consequence, at each tier of the supply chain, downstream organizations were frequently redoing the compliance work already performed by other upstream organizations.
ko: 결과적으로 소프트웨어 공급망 내 각 단계에서의 하위 조직은 상위 조직에서 이미 수행한 컴플라이언스 작업을 다시 수행하는 일이 자주 발생하게 되었다.

source: Assign individual(s) responsible for managing internal FOSS compliance.
ko: 내부 FOSS Compliance를 관리할 개인을 지정한다.

source: Assign individual(s) responsible for receiving external FOSS inquiries;
ko: FOSS 관련 외부 문의 접수를 책임질 담당자를 지정한다;

source: Assign responsibilities to develop and maintain FOSS compliance policy and processes;
ko: FOSS 정책 및 프로세스를 개발하고 유지할 책임을 할당한다;

source: At least 85% of all Software Staff are current, as per definition in above section.
ko: 적어도 소프트웨어 공급담당자의 85%가 현재 교육 이수 상태(위 정의됨).

source: At least 85% of the Software Staff are Currently Trained, as per the definition above.
ko: 소프트웨어 공급담당자의 85% 이상이 위의 정의에 따라 현재 교육 이수 상태

source: Basics of Intellectual Property law pertaining to FOSS and FOSS licenses;
ko: FOSS 및 FOSS 라이선스에 관한 지적재산법의 기본;

source: Basics of IP law pertaining to FOSS and FOSS licenses;
ko: FOSS 및 FOSS 라이선스에 관한 지적재산법의 기본 ;

source: Because OpenChain functions as an open source project translations are driven by those willing to contribute their time and expertise to perform translations under the terms of the CC-BY 4.0 license and the project’s translation policy.
ko: OpenChain은 오픈소스 프로젝트로서의 기능을 수행하기 때문에 번역은 CC-BY 4.0 라이선스 및 프로젝트의 번역 정책에 따라 번역을 수행하는데 시간과 전문 지식을 기꺼이 기여한 사람들에 의해 이루어집니다.

source: Commercially reasonable budget has been allocated.
ko: 상업적으로 합리적인 예산이 배정된다.

source: Compliance Artifacts - a collection of artifacts which represent the output of the FOSS management program for a Supplied Software release.
ko: 컴플라이언스 결과물 - 공급 대상 소프트웨어 배포에 대한 FOSS 관리 프로그램의 산출물을 나타내는 결과물 집합

source: Conformance with this version of the specification will last 18 months from the date conformance validation was achieved.
ko: 이 설명서 버전의 준수는 준수 인증이 이루어진 날로부터 18개월 동안 지속된다.

source: Contents
ko: 목차

source: Copies of the Compliance Artifacts of the Supplied Software release are archived and easily retrievable, and the archive is planned to exist for at least as long as the Supplied Software is offered or as required by the Identified Licenses (whichever is longer).
ko: 공급 대상 소프트웨어 배포판의 Compliance 결과물 사본이 보관되어 쉽게 다시 검색할 수 있으며, 보관된 자료는 적어도 공급대상 소프트웨어가 제공되는 한 혹은 식별된 라이선스에서 요구하는 기한 동안 제공된다. (둘 중 더 긴 것을 따름).

source: Copies of the Compliance Artifacts of the Supplied Software release are archived and easily retrievable, and the archive is planned to exist for at least as long as the Supplied Software is offered or as required by the Identified Licenses (whichever is longer)
ko: 공급 대상 소프트웨어 배포판의 컴플라이언스 결과물 사본이 보관되어 쉽게 다시 검색할 수 있으며, 보관된 자료는 적어도 공급대상 소프트웨어가 제공되는 한 혹은 식별된 라이선스에서 요구하는 기한 동안 제공된다(둘 중 더 긴 것을 따름).

source: Copies of the Distributed Compliance Artifacts of the Supplied Software are archived and easily retrievable (e.g., legal notices, source code, SPDX documents), and the archive is planned to exist for at least as long as the Supplied Software is offered or as required by the Identified Licenses (whichever is longer).
ko: 배포할 Compliance 결과물의 사본이 보관되어 쉽게 검색할 수 있다 (예: 법적 고지, 소스 코드, SPDX 문서). 보관된 자료는 적어도 공급대상 소프트웨어가 제공되는 한 혹은 식별된 라이선스에서 요구하는 기한 동안 존재할 예정이다 (둘 중 더 긴 것을 따름).

source: Copyright and License
ko: 저작권과 라이선스

source: Definitions
ko: 제2절 정의

source: Disclaimer
ko: 면책

source: Distributed Compliance Artifacts - the set of artifacts that an Identified License requires be provided with Supplied Software.
ko: 배포할 Compliance 결과물 - 식별된 라이선스가 공급대상 소프트웨어와 함께 제공하기를 요구하는 결과물의 집합.

source: Documented Method for tracking the completion of the training for the Software Staff.
ko: 소프트웨어 공급담당자가 교육을 완료하였는지 추적하는 문서화된 방법.

source: Ensure an organization has given reasonable consideration to developing a policy with respect to publicly contributing to FOSS. The FOSS contribution policy can be made a part of the overall FOSS policy of an organization or be its own separate policy. In the situation where contributions are not permitted at all, a policy should exist making that position clear.
ko: FOSS에 공개적으로 기여하는 것과 관련한 정책 개발을 위해 조직이 합당한 고려를 하도록 보장하기 위함. FOSS 기여 정책은 조직의 전체 FOSS 정책의 일부로 만들 수도 있고, 자체적인 별도의 정책으로 만들 수도 있다. 기여가 전혀 허용되지 않는 상황이라면, 이를 명확히 하는 정책이 있어야 한다.

source: Ensure there is a reasonable way for third parties to contact the organization with regard to FOSS compliance inquiries and that this responsibility has been effectively assigned.
ko: 제3자가 FOSS Compliance 문의와 관련하여 조직에 연락할 수 있는 합리적인 방법이 있고, 이 책임이 효과적으로 할당되도록 보장하기 위함.

source: Ensure an organization has a documented process for how the organization publicly contributes FOSS. A policy may exist such that contributions are not permitted at all.
ko: 공개적으로 FOSS에 기여하는 방법에 대한 문서화된 프로세스를 조직이 갖도록 보장하기 위함.

source: Ensure an organization has a documented process for how the organization publicly contributes FOSS.
ko: 공개적으로 FOSS에 기여하는 방법에 대한 문서화된 프로세스를 조직이 갖도록 보장하기 위함.

source: Ensure an organization has given reasonable consideration to developing a policy with respect to publicly contributing to FOSS.
ko: FOSS에 대한 공개적 기여와 관련한 정책 개발을 위해 조직이 합당한 고려를 하도록 보장하기 위함.

source: Ensure certain FOSS responsibilities have been effectively assigned.
ko: FOSS 책임이 효과적으로 할당되도록 보장하기 위함.

source: Ensure steps were taken to create, record and make Software Staff aware of the existence of a FOSS policy. Although no requirements are provided here on what should be included in the policy, other sections may impose requirements on the policy.
ko: FOSS 정책을 수립 및 기록하고 이를 Software 공급담당자가 인식하게 하는 조치가 취해지도록 보장하기 위함. 이 절에서는 정책에 포함되어야 할 요구사항이 규정되지 않지만, 다른 절에서 정책에 요구사항을 부과할 수도 있다.

source: Ensure steps were taken to create, record and make Software Staff aware of the existence of a FOSS policy.
ko: FOSS 정책을 수립 및 기록하고 이 존재를 소프트웨어 공급담당자가 인식하게 하는 조치가 취해지도록 보장하기 위함.

source: Ensure the Software Staff have recently attended FOSS training and that a core set of relevant FOSS topics are covered.
ko: 소프트웨어 공급관리자가 최근 FOSS 교육에 참석하고 FOSS 교육이 핵심 FOSS 주제를 다루도록 보장하기 위함.

source: Ensure the complete collection of Compliance Artifacts accompany the Supplied Software as required by the Identified Licenses that govern the Supplied Software along with other reports created as part of the FOSS review process.
ko: 공급대상 소프트웨어에 적용되는 식별된 라이선스에 따라 요구되는 Compliance 결과물의 집합이 FOSS 검토 프로세스의 일부로 작성된 기타 보고서와 함께 공급대상 소프트웨어에 수반하도록 보장하기 위함.

source: Ensure the complete collection of compliance artifacts accompany the Supplied Software as required by the Identified Licenses that govern the Supplied Software.
ko: 공급대상 소프트웨어에 적용되는 식별된 라이선스에서 요구하는 대로 완전한 Compliance 산출물 집합이 공급대상 소프트웨어에 수반하도록 보장하기 위함.

source: Ensure there is a reasonable way for third parties to contact the organization with regard to FOSS compliance inquiries.
ko: 제3자가 FOSS Compliance 문의와 관련하여 조직에 연락할 수 있는 합리적인 방법이 유지되도록 보장하기 위함.

source: Escalation path is available for resolution of FOSS compliance issues.
ko: FOSS Compliance 이슈의 해결을 위한 긴급대응절차가 있다.

source: FOSS (Free and Open Source Software) - software subject to one or more licenses that meet the Open Source Definition published by the Open Source Initiative (OpenSource.org) or the Free Software Definition (published by the Free Software Foundation) or similar license.
ko: FOSS (Free and Open Source Software) - Open Source Initiative (OpenSource.org)에서 발표한 오픈소스 정의 혹은 Free Software Foundation에서 발표한 Free Software 정의를 충족하는 라이선스, 혹은 유사한 라이선스가 하나 이상 적용된 소프트웨어.

source: FOSS Liaison - a designated person who is assigned to receive external FOSS inquires.
ko: FOSS 연락담당자 - 외부로부터의 FOSS 문의를 받도록 지정된 사람.

source: FOSS Liaison function is publicly identified (e.g., via an email address and/or the Linux Foundation’s Open Compliance Directory).
ko: FOSS 연락담당자의 역할이 공개적으로 확인된다. (예: 이메일주소 및/또는 Linux Foundation의 Open Compliance Directory를 통해).

source: FOSS Liaison must make commercially reasonable efforts to respond to FOSS compliance inquiries as appropriate; and
ko: FOSS 연락담당자는 FOSS 컴플라이언스 문의에 적절히 대응하기 위해 상업적으로 합리적인 노력을 해야 한다; 그리고

source: FOSS compliance management activity is sufficiently resourced:
ko: FOSS 컴플라이언스 관리 활동에는 충분한 자원이 공급된다:

source: FOSS component records exist for each Supplied Software release which demonstrates the documented procedure was properly followed.
ko: 각 공급 대상 소프트웨어 배포판에 대해 문서화된 절차가 올바르게 수행되었음을 증명하는 FOSS Component 기록이 존재한다.

source: FOSS component records for each Supplied Software release which demonstrates the documented procedure was properly followed.
ko: 문서화된 절차가 각 공급 대상 소프트웨어 배포판에 대해 올바르게 수행되었음을 입증하는 FOSS Component 기록

source: FOSS course materials covering the above topics exists (e.g., slide decks, online course, or other training materials).
ko: 위의 주제를 다루는 FOSS 과정 자료(예: 슬라이드 자료, 온라인 과정 혹은 이외 교육 자료)가 존재한다.

source: FOSS licensing concepts (including the concepts of permissive and copyleft licenses);
ko: FOSS 라이선싱 개념 (Permissive 및 Copyleft 라이선스 개념 포함)

source: FOSS project licensing models;
ko: FOSS 프로젝트 라이선싱 모델;
